Tekla Open API Reference for Tekla Structures 2025
AnalysisConnectivity.Connectivity Property
 The connectivity type of the analysis connectivity.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisConnectivity.ConnectivityEnum[] Connectivity { get; set; }
Public Property Connectivity As AnalysisConnectivity.ConnectivityEnum()
	Get
	Set
Property Value
Type: AnalysisConnectivity.ConnectivityEnum[]
See Also
Reference
AnalysisConnectivity Class
Tekla.Structures.Analysis Namespace